OdIfc.Utils.getSiUnitScaleFactor(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves scale factor for SI unit.
\param namedUnit [in] OdDAIObjectId as SI unit identifier to extract scale factor for.
\param unitType [in] Unit type string value from allowed unit types of IfcNamedUnit.
\param unitName [in] Unit name string value from allowed unit name of IfcSiUnit.
\returns Double value of scale factor for unit.

OdIfc.Utils.getConversionUnitScaleFactor(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Retrieves scale factor for conversion based unit.
\param namedUnit [in] OdDAIObjectId as conversion based unit identifier to extract scale factor for.
\param unitType [in] Unit prefix string value from allowed unit types of IfcNamedUnit.
\param targetFactor [in] scale factor of target unit based on prefix.
\returns Double value of scale factor for unit.

OdIfc.Utils.getPrefixUnitScale(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves scale factor for unit prefix.
\param unitPrefix [in] Unit prefix string value.
\returns Double value of scale factor for unit prefix.

OdIfc.Utils.getPresentationLayers(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves identifiers of layers items for specified product.
\param product [in] OdDAIObjectId as product identifier to find layers items for.
\returns OdDAIObjectIds, array of OdDAIObjectId instances, which contains layers items as IfcPresentationLayerAssignments and its subclasses or empty array otherwise.

OdIfc.Utils.getPresentationLayerAssignmentProducts(OdArray&lt;OdDAIObjectId,OdObjectsAllocator&lt;OdDAIObjectId&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves identifiers of products which representation items are assigned for specified layers collection.
\param layers [in] OdDAIObjectIds as collection of IfcPresentationLayerAssignment and its subclasses to find representation items for.
\returns OdDAIObjectIds, array of OdDAIObjectId instances, which contain products items or empty array otherwise.

OdIfc.Utils.getProductsRepresentations(OdArray&lt;OdDAIObjectId,OdObjectsAllocator&lt;OdDAIObjectId&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves identifiers of representation items for specified products collection.
\param products [in] OdDAIObjectIds as collection of products to find representation items for.
\returns OdDAIObjectIds, array of OdDAIObjectId instances, which contain representation items or empty array otherwise.

OdIfc.Utils.getSubItemsByType(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;!System.Runtime.CompilerServices.IsConst,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves subitems identifiers of current IfcElement on decompose, containment or voids relationship with specified type.
\param instance [in] A pointer to IFC application instance.
\param subItemType [in] OdAnsiString that contains subitem types to extract.
\returns OdDAIObjectIds, array of OdDAIObjectId instances, which contain subitems identifiers or empty array otherwise.

OdIfc.Utils.getSubItems(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;!System.Runtime.CompilerServices.IsConst)
\details
Retrieves subitems identifiers of current IfcElement based on decompose, containment or voids relationship.
\param instance [in] A pointer to IFC application instance.
\returns OdDAIObjectIds, array of OdDAIObjectId instances, which contain subitems identifiers or empty array otherwise.

OdIfc.Utils.assignGlobalId(OdIfc.OdIfcInstance*)
\details
Assigns a generated global identifier to the "GlobalId" attribute  of an entity derived from an IfcRoot object.
\param inst [in] A raw pointer to the IFC entity instance.
\returns true if the attribute "GlobalId" was successfully assigned; otherwise the method returns false.